jaxws-spring-soap/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:cal="http://igastei.com.br/types/calculator">
    <soapenv:Header/>
    <soapenv:Body>
        <cal:AdditionInput>
            <cal:number1>2</cal:number1>
            <cal:number2>4</cal:number2>
        </cal:AdditionInput>
    </soapenv:Body>
</soapenv:Envelope> 